src/cf/src/Documents/ЗаказПокупателя/ЗаказПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказПокупателя</name>
  <basedOn>Document.РеализацияТоваровУслуг</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыСКонтрагентами</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Менеджер</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаБезНДС</name>
    <type>
      <types>DefinedType.СуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>ECommerce</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Доставлен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказСWEBСайта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокументаЭлектронногоОбмена</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>МенеджерПодтвердилПроверилОстаток</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧТовары</name>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>DefinedType.КодСтроки</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>НоменклатураСтрока</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <type>
        <types>CatalogRef.УпаковкиЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоУпаковок</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.КоличествоНеотрицательное</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидЦены</name>
      <type>
        <types>CatalogRef.ВидыЦен</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаSKU</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентСкидки</name>
      <type>
        <types>DefinedType.ПроцентСкидки</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСкидки</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>CatalogRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
    <attributes>
      <name>СкидкаНаЦену</name>
      <type>
        <types>DefinedType.СуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/cf/src/Enums/СтатусыЗаказовПокупателя/СтатусыЗаказовПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыЗаказовПокупателя</name>
  <enumValues>
    <name>Новый</name>
  </enumValues>
  <enumValues>
    <name>ВРаботе</name>
  </enumValues>
  <enumValues>
    <name>ВПроизводстве</name>
  </enumValues>
  <enumValues>
    <name>ПереданСубподрядчику</name>
  </enumValues>
  <enumValues>
    <name>ПолученОтСубподрядчика</name>
  </enumValues>
  <enumValues>
    <name>Собран</name>
  </enumValues>
  <enumValues>
    <name>Отгружен</name>
  </enumValues>
  <enumValues>
    <name>Доставлен</name>
  </enumValues>
  <enumValues>
    <name>Черновик</name>
  </enumValues>
  <enumValues>
    <name>ФормируетсяПотребность</name>
  </enumValues>
  <enumValues>
    <name>ЗаказПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ВосполнениеПотребности</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОтгрузки</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетОплаты</name>
  </enumValues>
  <enumValues>
    <name>Выполнен</name>
  </enumValues>
</mdclass:Enum>

src/cf/src/Documents/ЗаказПокупателя/Forms/ФормаСпискаПроизводство/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтборПоСтатусу = "Все";  
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	ДСТовары.Параметры.УстановитьЗначениеПараметра("Ссылка", Документы.ЗаказПокупателя.ПустаяСсылка());
	ДССтруктураПодчиненности.Параметры.УстановитьЗначениеПараметра("Ссылка", Документы.ЗаказПокупателя.ПустаяСсылка());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	ТекЗаказ = ?(ТекСтрока = Неопределено,
		ПредопределенноеЗначение("Документ.ЗаказПокупателя.ПустаяСсылка"), ТекСтрока.Ссылка);
	УстановитьПараметрыДеталей();
КонецПроцедуры

&НаКлиенте
Процедура ДССтруктураПодчиненностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Ссылка = Элемент.ТекущиеДанные.Ссылка;
	ПараметрыОткрытия = Новый Структура("Ключ", Ссылка);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияДокумента", ЭтотОбъект);
	ОткрытьФорму(ИмяФормыОбъекта(Ссылка), ПараметрыОткрытия, ЭтотОбъект, , , , Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоСтатусуПриИзменении(Элемент)
	УдалитьОтбор(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Статус");
	Если ОтборПоСтатусу = "Новый" Или ОтборПоСтатусу = "ВРаботе" Или ОтборПоСтатусу = "Собран" Тогда                                     
		ДанныеВыбора = ПолучитьСтатусыЗаказовПокупателя(ОтборПоСтатусу);
		ДобавитьОтбор(Список.КомпоновщикНастроек.ФиксированныеНастройки.Отбор, "Статус", ДанныеВыбора, ВидСравненияКомпоновкиДанных.Равно);		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПослеЗакрытияДокумента(Результат, ДопПараметры) Экспорт
	Элементы.Список.Обновить();
	Элементы.ДССтруктураПодчиненности.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыДеталей()
	ДСТовары.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекЗаказ);
	ДССтруктураПодчиненности.Параметры.УстановитьЗначениеПараметра("Ссылка", ТекЗаказ);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяФормыОбъекта(Знач Ссылка)
	Возврат Ссылка.Метаданные().ПолноеИмя() + ".ФормаОбъекта";
КонецФункции

&НаСервере
Функция ПолучитьСтатусыЗаказовПокупателя(Знач ОтборПоСтатусу)
	Если ОтборПоСтатусу = "Новый" Тогда
		Возврат Перечисления.СтатусыЗаказовПокупателя.Новый; 
	КонецЕсли;
	Если ОтборПоСтатусу = "ВРаботе" Тогда
		Возврат Перечисления.СтатусыЗаказовПокупателя.ВРаботе; 
	КонецЕсли;  
	Если ОтборПоСтатусу = "Собран" Тогда
		Возврат Перечисления.СтатусыЗаказовПокупателя.Собран; 
	КонецЕсли;
КонецФункции

&НаКлиенте
Функция ДобавитьОтбор(СписокОтборов, ИмяПоля, Значение, ВидСравнения = Неопределено, Использование = Истина)
	НовыйЭлемент = СписокОтборов.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных(ИмяПоля);
	НовыйЭлемент.ВидСравнения = ?(ВидСравнения = Неопределено, ВидСравненияКомпоновкиДанных.Равно, ВидСравнения);
	НовыйЭлемент.ПравоеЗначение = Значение;
	НовыйЭлемент.Использование = Использование;
	Возврат НовыйЭлемент;
КонецФункции

&НаКлиенте
Функция УдалитьОтбор(СписокОтборов, ИмяПоля = "")
	Если ПустаяСтрока(ИмяПоля) Тогда
		СписокОтборов.Элементы.Очистить();
		Возврат Истина;
	КонецЕсли;
	Поле = Новый ПолеКомпоновкиДанных(ИмяПоля);
	ОтборУдален = Ложь;
	УдаляемыеЭлементы = Новый Массив;
	Для Каждого ЭлементОтбора Из СписокОтборов.Элементы Цикл
		Если ЭлементОтбора.Использование И ЭлементОтбора.ЛевоеЗначение = Поле Тогда
			УдаляемыеЭлементы.Добавить(ЭлементОтбора);
		КонецЕсли;
	КонецЦикла;
	Для Каждого ЭлементОтбора Из УдаляемыеЭлементы Цикл
		СписокОтборов.Элементы.Удалить(ЭлементОтбора);
		ОтборУдален = Истина;
	КонецЦикла;
	Возврат ОтборУдален;
КонецФункции

#КонецОбласти
